VatEngine/test3-FR-FR.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?><?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?><iVATEngineInput><Supplier><ID>21540</ID><Name>FRCOMPANY SA</Name><Address>RUE NATIONAL 15</Address><ZIP>59800</ZIP><City>LILLE</City><Country>FR</Country><RegOfCommerce></RegOfCommerce><BancAccountNumber></BancAccountNumber><IBAN></IBAN><BIC></BIC><TelephoneNumber></TelephoneNumber><FaxNumber></FaxNumber><EmailAddress></EmailAddress><SpecialType>0</SpecialType><DeductionType>0</DeductionType><VATNumberSupplier Country="FR"><VATNumber>FR01160568416</VATNumber><VATNumberType>1</VATNumberType><Name></Name><Address1></Address1><Address2></Address2><Address3></Address3><TaxNumber></TaxNumber><BelongsToFiscalUnit>0</BelongsToFiscalUnit></VATNumberSupplier><CountryChosenVATNumber>FR</CountryChosenVATNumber></Supplier><Customer><ID>21679</ID><Name>FRGLOBAL</Name><Address>RUE BLANCHE 9</Address><ZIP>75833</ZIP><City> PARIS</City><EmailAddress></EmailAddress><Country>FR</Country><SpecialType>0</SpecialType><VATNumberCustomer Country="FR"><VATNumber>FRXY111245362</VATNumber><VATNumberType>2</VATNumberType><Name>NLAGENT NL214482805B02</Name><Address1>DENNEWEG 19</Address1><Address2>2514CC S GRAVENHAGE</Address2><Address3></Address3><RequiredOnInvoicePicture>false</RequiredOnInvoicePicture><BelongsToFiscalUnit>0</BelongsToFiscalUnit></VATNumberCustomer><CountryChosenVATNumber>FR</CountryChosenVATNumber></Customer><InvoiceProperties><DocumentType>0</DocumentType><Disconto>0</Disconto><Currency1>EUR</Currency1><InvoiceNumber>2</InvoiceNumber><ReferenceInvoiceNumber></ReferenceInvoiceNumber><InvoiceDate>2018-06-28</InvoiceDate><OfficialLanguage>2</OfficialLanguage></InvoiceProperties><Item ID="1"><Properties><Description></Description><InternationalDescription LanguageID="1">menselijke organen, menselijk bloed, moedermelk (-101-)</InternationalDescription><InternationalDescription LanguageID="2">organes humains, sang humain, lait maternelle (-101-)</InternationalDescription><InternationalDescription LanguageID="3">human organs, human blood and mother milk (-101-)</InternationalDescription><InternationalDescription LanguageID="5">menschlichen Organen, Blut, Muttermilch (-101 -)</InternationalDescription><TaricCode></TaricCode><ItemClassificationCode>101</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>100</UnitPriceExclVAT><TotalAmountExclVAT>100</TotalAmountExclVAT><PackagingCosts>0</PackagingCosts></Amounts><Number>1</Number><Unit></Unit><VATRate>0</VATRate><Reduction>0</Reduction><AdditionalProperties><PropertiesPerCountry Country="FR"><VATRateCode>S</VATRateCode></PropertiesPerCountry><EngineParameter1>AAAB</EngineParameter1><EngineParameter2></EngineParameter2><EngineParameter3></EngineParameter3></AdditionalProperties><OutOfVAT>0</OutOfVAT><ReportingProperties><CommodityCode></CommodityCode></ReportingProperties></Properties><Conditions><ShipFrom><CountryDeparture>FR</CountryDeparture></ShipFrom><ShipTo><CountryArrival>FR</CountryArrival></ShipTo><Installation>0</Installation><SupplyIn>0</SupplyIn><Transporter>0</Transporter><DateTransaction>2018-06-28</DateTransaction></Conditions><Mentioning Country="FR"><Number>105</Number><Text>exonéré   ||  Article 132, paragraphe 1, point d) - Directive 2006/112</Text></Mentioning><AdditionalMentioning><Text>Les biens ne sont pas installés. / The goods are not installed.</Text></AdditionalMentioning><AdditionalMentioning><Text>Les biens se trouvent en France. / The goods are located in France.</Text></AdditionalMentioning></Item><Item ID="2"><Properties><Description></Description><InternationalDescription LanguageID="1">Kleven van etiketten</InternationalDescription><InternationalDescription LanguageID="2">Transport de personnes / Transport maritime (-201-)</InternationalDescription><InternationalDescription LanguageID="3">Transportation of persons / BY sea (-201-)</InternationalDescription><InternationalDescription LanguageID="4">Transporte de personas / Por mar</InternationalDescription><InternationalDescription LanguageID="5">Personenbeförderung / Auf dem Seeweg</InternationalDescription><InternationalDescription LanguageID="6">Trasporto di persone / Via mare</InternationalDescription><InternationalDescription LanguageID="7">Transporte de pessoas / Por via marítima</InternationalDescription><InternationalDescription LanguageID="10">Transport af personer / På havet</InternationalDescription><InternationalDescription LanguageID="11">Transport av personer / Sjövägen</InternationalDescription><TaricCode /><ItemClassificationCode>201</ItemClassificationCode><CPCCode /><Amounts CurrencyNumber="1"><UnitPriceExclVAT>100</UnitPriceExclVAT><TotalAmountExclVAT>100</TotalAmountExclVAT><PackagingCosts>0</PackagingCosts></Amounts><Number>1</Number><Unit /><VATRate>0</VATRate><Reduction>0</Reduction><AdditionalProperties><PropertiesPerCountry Country="FR"><VATRateCode>R</VATRateCode></PropertiesPerCountry><EngineParameter1 /><EngineParameter2>AA000A00000000B</EngineParameter2><EngineParameter3 /></AdditionalProperties><OutOfVAT>0</OutOfVAT></Properties><Conditions><ShipFrom><CountryDeparture>FR</CountryDeparture></ShipFrom><ShipTo><CountryArrival>FR</CountryArrival></ShipTo><ContinuousSupply>0</ContinuousSupply><DateTransaction>2018-06-28</DateTransaction></Conditions><Mentioning Country="FR"><Number>46</Number><Text>Exempté de TVA - Art. 262-II. 8° du C.G.I.</Text></Mentioning><AdditionalMentioning><Text>Le transport commence de France vers France. / The transport departs from France and goes to France.</Text></AdditionalMentioning></Item><Item ID="3"><Properties><Description></Description><InternationalDescription LanguageID="1">voorschotten (-301-)</InternationalDescription><InternationalDescription LanguageID="2">avances (-301-)</InternationalDescription><InternationalDescription LanguageID="3">repayment of expenditures (-301-)</InternationalDescription><InternationalDescription LanguageID="5">Vorschüsse (-301-)</InternationalDescription><TaricCode /><ItemClassificationCode>301</ItemClassificationCode><CPCCode /><Amounts CurrencyNumber="1"><UnitPriceExclVAT>100</UnitPriceExclVAT><TotalAmountExclVAT>100</TotalAmountExclVAT><PackagingCosts>0</PackagingCosts></Amounts><Number>1</Number><Unit /><VATRate>0</VATRate><Reduction>0</Reduction><AdditionalProperties><PropertiesPerCountry Country="FR"><VATRateCode>U</VATRateCode></PropertiesPerCountry><EngineParameter1 /><EngineParameter2 /><EngineParameter3>0B</EngineParameter3></AdditionalProperties><OutOfVAT>1</OutOfVAT></Properties><Conditions><DateTransaction>2018-06-28</DateTransaction></Conditions></Item><AmountsSummary CurrencyNumber="1"><VATTotals VATRate="0"><AmountDisconto>0</AmountDisconto><AmountExclVAT>200</AmountExclVAT><AmountVAT>0</AmountVAT></VATTotals><Totals><TotalAmountVAT>0</TotalAmountVAT><TotalAmountInclVAT>300</TotalAmountInclVAT><TotalAmountDisconto>0</TotalAmountDisconto><TotalAmountInclVATCash>300</TotalAmountInclVATCash><TotalAmountPackagingCosts>0</TotalAmountPackagingCosts></Totals></AmountsSummary><CheckValue>100</CheckValue></iVATEngineInput>]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>